# აქ მე შემოვაყვანინე მომხმარებელს ინფორმაცია, კონკრეტულად სახელი 
# და შევინახე "user_name" ცვლადში
user_name = input("Please enter your name: ")

# აქ მე შემოვაყვანინე მომხმარებელს ინფორმაცია, კონკრეტულად გვარი 
# და შევინახე "user_last_name" ცვლადში
user_last_name = input("Please enter your last name: ")

# აქ მე შემოვაყვანინე მომხმარებელს ინფორმაცია, კონკრეტულად ასაკი 
# და შევინახე "user_age" ცვლადში
user_age = input("Please enter your age: ")

# მე გამოვიტანე მომხმარებლის სრული სახელი და გვარი ტერმინალში 
# print ფუნქციის დახმარებით
print("User full name: " + user_name + " " + user_last_name)

# მე გამოვიტანე მომხმარებლის ასაკი ტერმინალში print ფუნქციის 
# დახმარებით
print("User age: " + user_age)

# 1) კოდში კომენტარების დატოვება - მომავალში ჩვენ ან სხვა 
# developer-ებს მოგვიწევს კოდის კითხვა, მაგრამ დიდი დრო რომ არ 
# დაიხარჯოს ჩვენ ვტოვებთ კომენტარებს რათა რ მოგვიწიოს კოდის 
# თავიდან კითხვა და გააზრება 
# 2) snake_case - როდესაც ვქმნით ცვლადებს ჩვენ უნდა მივყვეთ რაიმე 
# სტანდარტს, snake_case-არის ერთ-ერთი სტანდარტი, რომლის 
# მიხედვითაც უნდა შევქმნათ ცვლადები.

