# შექმენით ორი ცვლადი: `a = 35` და `b = 6`.
# შეასრულეთ ამ ორ რიცხვს შორის ყველა მათემატიკური ოპერაცია (`+`, `-`, `/`, `*`, `%`, `//`, `**`) და შედეგები გამოიტანეთ ტერმინალში.
# კომენტარების სახით ახსენით მხოლოდ `%`, `//` და `**` ოპერატორების დანიშნულება.


a = 35
b = 6

print(a + b)
print(a - b)
print(a / b)
print(a * b)
print(a % b)
print(a // b)
print(a ** b)


# %-აღნიშნავს ნაშთიან გაყოფას, //-არის იგივე გაყოფა მაგრამ ტერმინალში გამოდის მთელი რიცხვის სახით, **- ამ ოპერატორით რიცხვები აგვყავს ხარისხში